; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image3 - mode
	spectrograph4 - mode
	image2 - mode
	infrared0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star5 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	Star10 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	Star6 - direction
	Star3 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(supports instrument0 spectrograph4)
	(supports instrument0 image1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(pointing satellite0 Planet15)
	(have_image Planet13 image3)
	(have_image Star14 infrared0)
	(have_image Planet15 spectrograph4)
	(have_image Planet16 infrared0)
	(have_image Star17 infrared0)
))

)

; plan
1. (turn_to satellite0 star3 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star3)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 star14 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star14)
   goals met: 0 of 6
5. (take_image satellite0 star14 instrument0 infrared0)
   added: (have_image star14 infrared0)
   goals met: 1 of 6
6. (turn_to satellite0 planet16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet16)
   goals met: 1 of 6
7. (take_image satellite0 planet16 instrument0 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 2 of 6
8. (turn_to satellite0 planet13 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet13)
   goals met: 2 of 6
9. (take_image satellite0 planet13 instrument0 image3)
   added: (have_image planet13 image3)
   goals met: 3 of 6
10. (turn_to satellite0 star17 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star17)
   goals met: 3 of 6
11. (take_image satellite0 star17 instrument0 infrared0)
   added: (have_image star17 infrared0)
   goals met: 4 of 6
12. (turn_to satellite0 planet15 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 planet15)
   goals met: 5 of 6
13. (take_image satellite0 planet15 instrument0 spectrograph4)
   added: (have_image planet15 spectrograph4)
   goals met: 6 of 6
